response.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:bme="http://ibbus.jpmorgan.com/2009/bus-message-envelope" xmlns="http://refdata.jpmorgan.com/2012/otc-1" bme:version="1-2"><env:Header><bme:Timestamp>2021-10-25T10:38:32</bme:Timestamp><bme:MessageId>urn:uuid:1325d458-430d-4c24-ab76-a5639a463e1d</bme:MessageId><bme:RefToMessageId>93470db7-b709-45aa-bffd-631f1ab467f2</bme:RefToMessageId><bme:PayloadInfo><bme:PartInfo><bme:MessageStandard>RDT</bme:MessageStandard><bme:MessageType>referenceData</bme:MessageType><bme:PartProperties><bme:Property name="messageSearchKey">OTC</bme:Property></bme:PartProperties></bme:PartInfo></bme:PayloadInfo></env:Header><env:Body><referenceData><otcs schemaVersion="1-10"><otc><instrumentId>BB8A0493</instrumentId><version>1</version><lastUpdatedTimestamp>2020-07-28T09:30:21</lastUpdatedTimestamp><createdTimestamp>2020-07-28T09:30:21</createdTimestamp><status>ACTIVE</status><modelClass>OTC</modelClass><name>FX Spot/07/28/2020/P:HKD R:GBP/1.2806557377</name><contributor>jpmc:ATHENA</contributor><assetClassifications><cfs><assetClass>Foreign Exchange</assetClass><product>Spot</product><subProduct></subProduct></cfs></assetClassifications><contractInstrument><contractInstrumentTypeName>Forward</contractInstrumentTypeName><contractStartDate>2020-07-28</contractStartDate><settlementTypeName>Physical</settlementTypeName><forward><fxContract><referenceCurrencyIdentifier>GBP</referenceCurrencyIdentifier><quoteCurrencyIdentifier>HKD</quoteCurrencyIdentifier><exchangeRate>1.2806557377049181</exchangeRate><quoteBasisName>Reference Currency Per Quote Currency</quoteBasisName><valueDate>2020-07-28</valueDate><instrumentLegs><instrumentLeg><identifierDomain>jpmc:ATHENA</identifierDomain><identifierValue>Leg1</identifierValue><legTypeName>Reference Currency Leg</legTypeName><legEffectiveDate>2020-07-28</legEffectiveDate><terminationDate>2020-07-28</terminationDate><settlementCurrencyIdentifier>GBP</settlementCurrencyIdentifier><settlementTypeName>Physical</settlementTypeName></instrumentLeg><instrumentLeg><identifierDomain>jpmc:ATHENA</identifierDomain><identifierValue>Leg2</identifierValue><legTypeName>Quote Currency Leg</legTypeName><legEffectiveDate>2020-07-28</legEffectiveDate><terminationDate>2020-07-28</terminationDate><settlementCurrencyIdentifier>HKD</settlementCurrencyIdentifier><settlementTypeName>Physical</settlementTypeName></instrumentLeg></instrumentLegs></fxContract></forward></contractInstrument></otc></otcs></referenceData></env:Body></env:Envelope>